[
	[
		{
			"title": "Why (Web-)Development?",
			"content": [
				"It's not like it was my first choice as a kid (that would have been airline pilot), but it's been my plan B since I wrote my first lines of code in Amiga-Basic.",
				"Through the years, I learned that development suits my character more and (meanwhile switched to qBasic on MS-DOS) it became my goal to become a developer.",
				"In my teenage-years, I discovered the then new and expensive-to-use internet. This opened 2 doors at once:",
				[
					"right-mouse-click -> view source",
					"and a few years later, a way to show my work to the world (geocities) without exchanging floppy-disks."
				],
				"Being able to remove/duplicate parts of code to see which does what was great until I have gotten an offline-version of SelfHTML which laid the foundation to my HTML-Knowledge.",
				"Expecting that this &quot;Internet&quot; could become real big, I jumped on that train, left qBasic etc. behind, and although I have some concerns about the internet, there is nothing I would rather do for a living then development in a Web-Environment."
			]
		},
		{
			"title": "Why did i work in other IT-Departments before?",
			"content": [
				"Fresh from school, finding my dream job turned out harder than I thought, especially without attending any university. So I choose a different approach. I started in a rather low-level job and proven that I am capable of managing more challenging tasks. This worked pretty well but put me in a totally unexpected direction. Digital TV was just getting started in Austria (at least via Cable) and it turned out to be very interesting to me. Seems I have shown the most interest in how it technically works, I was chosen to move to change to more specified departments and ended up in the 3rd Level Support.",
				"Web-Development stuck with me for all these years as a hobby, mostly making websites that were related to music (bands and bars/clubs).",
				"When my company headquarter decided that all Level 3 Support will be done centralized for entire Europe in the Netherlands, I was assigned different, more low-level tasks, which simply I couldn't enjoy. Knowing that Digital TV via Cable is still rather rare in this form in Austria, I decided to move on and use the rest of the knowledge I collected, in a different company. My first choice was 'Herold Business Data' because they have a pretty big and complex website (online telephone book for Austria) and hoped to get a chance to join the Development Team.",
				"As this team was big enough and nobody left for many years it took some time to get my chance but when I finally have been given the chance I took it and according to the words of my team lead didn't disappoint."
			]
		},
		{
			"title": "Why you should choose me?",
			"content": [
				"Am I a perfect developer? No!",
				"Am I an honest person? Yes!",
				"I am fully aware that there are developers out there that studied, have decades of experience and dozens of projects done. Some of those might even be available at the moment, but I am working with:",
				[
					"focus on details and farsightedness to the overall output.",
					"heart and soul as I love this activity right now and sure will do for many years to come.",
					"the goal to become the best developer I can.",
					"the knowledge about what I know and when to ask for help or guidance.",
					"the ability to admit my mistakes and do what I can to fix them."
				],
				"I have done the Job of a Senior for more than three and a half years, and I have made mistakes, but overall everyone was always satisfied with the work I have done. I am very proud of what I have done, what I have learned and how herold.at looks like now. Now I am looking for another company to help fulfil the vision of their websites or webapps."
			]
		},
		{
			"title": "Why I yearn to change?",
			"content": [
				"I would have a few reasons to quit myself, but the company decided to assign the further development of herold.at to another company. Therefore, they got no use for the development team anymore, and so we will part ways by end of March 2022."
			]
		}
	],
	[
		{
			"title": "Warum (Web-)Entwicklung?",
			"content": [
				"Es war nicht meine erste Wahl als ich noch ein Kind war (das war Flugkapitän), aber es war mein Plan-B seit ich die ersten Zeilen in Amiga-Basic geschrieben habe.",
				"Im Laufe der Jahre habe ich gelernt, dass Entwicklung eher meiner Natur entspricht und nachdem ich in der Zwischenzeit in qBasic auf MS-DOS programmierte war es mein Ziel das zum Beruf zu machen.",
				"Als Teenager entdeckte ich das damals neue und sehr teure Internet. Dies hat mir gleich zwei Türen geöffnet:",
				[
					"Klick mit der rechten Maustaste -> Zeige Quelltext",
					"und ein paar Jahre später - einen weg meine Arbeit mit der Welt zu teilen (Geocities) ohne Disketten tauschen zu müssen."
				],
				"Durch löschen und duplizieren bestimmter Teile des Quelltext konnte ich herausfinden was welcher Teil tut und als ich eine Offline-Version von SelfHTML bekommen habe legte ich den Grundstein für mein Wissen über Web-Entwicklung.",
				"Da ich damals vermutete, dass diese &quot;Internet&quot; sehr groß werden könnte bin ich auf diesen Zug aufgesprungen, habe alle andere Programmiersprachen hinter mir gelassen und obwohl ich das Internet nicht nur positiv sehe, gibt es nichts was ich lieber beruflich tun würde als Web-Entwicklung."
			]
		},
		{
			"title": "Warum habe ich zuvor in anderen IT-Abteilungen gearbeitet?",
			"content": [
				"Frisch von der Schule, war es mir nicht möglich sofort in meinem Traumjob zu arbeiten, insbesondere da ich nicht studiert habe. Daher habe ich einen anderen Ansatz gewählt. Ich habe in einem einfacheren Job angefangen und dort gezeigt, dass man mir auch schwierigere Aufgaben geben kann. Da ich das unter Beweis gestellt habe, öffnete sich eine Tür in eine unerwartete Richtung. Digital TV war in Österreich zu der Zeit relativ neu (zumindest über Kabel) und es war ein interessantes Thema für mich. Mit viel gezeigtem Einsatz und Interesse wie es technisch im Hintergrund funktioniert, konnte ich in immer spezialisiertere Abteilungen wechseln bis zuletzt um 3rd Level Helpdesk.",
				"Web-Entwicklung blieb für all die Jahre ein Hobby, hauptsächlich habe ich Webseiten mit Bezug zu Musik gemacht (Bands und Bars/Klubs)",
				"Als die Zentrale meiner Firma beschloss den Level 3 Support für Europa zentral in den Niederlanden zu bündeln, wurde ich mit anderen, viel simpleren, Aufgaben betraut, was für mich in keiner Weise erfüllend war. Ich wusste, dass mein Wissen über Digital TV über Kabel in Österreich mir in anderen Firmen nichts nutzen wird, also beschloss ich mich mit meinem restlichen Wissen in einer anderen Firma zu bewerben. Meine erste Wahl war 'Herold Business Data', da diese eine recht große und umfangreiche Webseite haben (online Telefonbuch für Österreich), in der Hoffnung in das Entwickler Team wechseln zu können.",
				"Da das Team groß genug war und es auch keine Kündigungen gab, dauerte es einige Jahre bis ich eine Chance bekam mich zu beweisen und laut meinem Teamleiter habe ich ihn keineswegs enttäuscht."
			]
		},
		{
			"title": "Warum sie mich wählen sollten?",
			"content": [
				"Bin ich ein perfekter Programmierer? Nein!",
				"ABin ich ein ehrlicher Mensch? Ja!",
				"Ich bin mir im Klaren, dass es Entwickler gibt die studiert, Jahrzehnte an Erfahrung und duzende Projekte gemacht haben. Manche sind vielleicht sogar gerade auf der Suche nach einem neuen Job, aber ich arbeite mit:",
				[
					"Fokus für Details und Weitsicht auf das große Ganze.",
					"Herz und Seele da ich diese Tätigkeit liebe und sicher noch viele Jahre lieben werde.",
					"dem Ziel der beste Programmierer zu werden der ich werden kann.",
					"dem Wissen was ich kann und wann ich besser um Hilfe/Unterstützung fragen sollte.",
					"der Fähigkeit für meine Fehler gerade zu stehen und zu tun was ich kann um sie zu korrigieren."
				],
				"Ich habe dreieinhalb Jahre den Job eines Senior gemacht, und unterm Strich waren immer alle mit meiner Arbeit zufrieden. Ich bin sehr stolz darauf was ich geschafft habe, was ich gelernt habe und wie herold.at dank meiner Mitarbeit aussieht. Jetzt suche ich eine neue Firma in der ich mithelfen kann die Visionen ihrer Webseiten oder Webapps umzusetzen."
			]
		},
		{
			"title": "Warum möchte ich mich beruflich verändern?",
			"content": [
				"Ich hätte wenige Gründe selbst zu kündigen, aber die Firma hat entschieden die Entwicklung von herold.at extern zu vergeben. Daher haben sie keine Verwendung mehr für die Entwicklungsabteilung, und wir werden mit Ende März 2022 getrennte Wege gehen."
			]
		}
	]
]
